"""Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль."""

def my_func(var_1, var_2):
    result = var_1 / var_2
    return result

print(my_func(2, 4))

